template_macros.org
#+HTML_LINK_HOME: index.html
#+HTML_LINK_UP: index.html
#+title: /Building a Text Templating System in C/
#+author: Jackson
#+date: 1/15/24
#+OPTIONS: toc:nil num:nil html-style:nil timestamp:nil
#+SETUPFILE: retro_dark.theme

/A continuation of the [[file:text_templating.org][previous article]]/.

* _Introduction_
In the previous article we built a templating engine that could take any plain text template and convert it into a C function that can output dynamic content at runtime. We learned a ton about how to build a parser, and how to generate C code based on these templates. However, the function interface that we created is a lot to deal with, especially for a programmer who is unfamiliar with the templates.

#+begin_src C
char *index_html(const char* testing, const char* name, const char* last_name, const char* title, const char* author, int hi);
#+end_src

Every variable has to be passed in explicitly, and in the correct order. Not an impossible thing to deal with, but it felt unnecessary. What if instead of accepting variables as parameters, our templates could infer both the value and type of these variables from their local scope. That is what we hope to accomplish in this article, which gives us a much simpler interface.

#+begin_src C
char *output = index_html();
#+end_src

* _Ground Work_
In order to accomplish what we laid out above we won't be able to use a standard function in C. What else can we use that looks like a function?

** _Function Macros_

C has a concept of [[https://en.wikipedia.org/wiki/Macro_(computer_science)#Parameterized_and_parameterless_macro][function macros]], which are able to accept parameters and even return values. We don't want our macro to accept any parameters, but it would be nice if it could return one. The whole goal of moving our template engine to a macro system is to make it easier on our users. Macros will allow us to do type inference on our variables!

A basic function macro in C takes the following form...

#+begin_src C
#define MAX(a, b) ((a) > (b) ? (a) : (b))
#+end_src

~A~ and ~B~ are the parameters of our function. We then make a comparison between the 2 variables, and returns the larger of the two. You may notice that we don't have an explicit ~return~ in the macro. How does that work?

Macros (and all the C preprocessor) run during compile time. The compiler generates a normal C code depending on the argument that are being passed. If the values are known entirely at compiler time then it can simply substitute the higher value. Otherwise, it will generate a simple ternary to find the larger of the 2 values.

#+begin_src C
int main(int argc, char **argv) {
  bool res = MAX(argc, 4);
}
#+end_src

Expanding the code above using ~-e~ will give us the following expanded code.

#+begin_src C
int main(int argc, char **argv) {
 _Bool res = ((argc) > (4) ? (argc) : (4));
}
#+end_src

The macro gets inlined into a single ternary. Would we be able to use something like this to implement our template engine? Of course! Our macro will return a pointer to the buffer that it allocated.

** _Type Inference_
C doesn't have type inference (well now it [[https://thephd.dev/c23-is-coming-here-is-what-is-on-the-menu#n3006--n3007---type-inference-for-object-definitions][does]]), but even if it did, this wouldn't allow us to omit format specifiers from our templates. Instead, we will use ~_Generic~ to print a variable based on its type. You may have seen [[file:c_generics.org][this article]] where we explored ~_Generic~ in C. We covered some more esoteric uses cases there. Here we will cover a more realistic use case.

It will be a simple function that chooses which format specifier to pass to ~sprintf~ based on the type of the variable being passed in. The great thing is that our users will still be able to use a custom format specifier if they desire.

* _Implementation_
We will take the same approach as before parsing out a template, and then generating C code to rebuild that template at runtime. We can start by building our the skeleton of our macro, and seeing how we can get that working.

