template_macros.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/Building a Text Templating System in C/</title>
<meta name="author" content="Jackson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title"><i>Building a Text Templating System in C</i></h1>
<p>
<i>A continuation of the <a href="text_templating.html">previous article</a></i>.
</p>
<div id="outline-container-orgef2419d" class="outline-2">
<h2 id="orgef2419d"><span class="underline">Introduction</span></h2>
<div class="outline-text-2" id="text-orgef2419d">
<p>
In the previous article we built a templating engine that could take any plain text template and convert it into a C function that can output dynamic content at runtime. We learned a ton about how to build a parser, and how to generate C code based on these templates. However, the function interface that we created is a lot to deal with, especially for a programmer who is unfamiliar with the templates.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">char</span> *<span style="color: #D9DAA2;">index_html</span>(<span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>* <span style="color: #85DDFF;">testing</span>, <span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>* <span style="color: #85DDFF;">name</span>, <span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>* <span style="color: #85DDFF;">last_name</span>, <span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>* <span style="color: #85DDFF;">title</span>, <span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>* <span style="color: #85DDFF;">author</span>, <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">hi</span>);
</pre>
</div>

<p>
Every variable has to be passed in explicitly, and in the correct order. Not an impossible thing to deal with, but it felt unnecessary. What if instead of accepting variables as parameters, our templates could infer both the value and type of these variables from their local scope. That is what we hope to accomplish in this article, which gives us a much simpler interface.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output</span> = index_html();
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd8a5e42" class="outline-2">
<h2 id="orgd8a5e42"><span class="underline">Ground Work</span></h2>
<div class="outline-text-2" id="text-orgd8a5e42">
<p>
In order to accomplish what we laid out above we won&rsquo;t be able to use a standard function in C. What else can we use that looks like a function?
</p>
</div>
<div id="outline-container-org92f4a76" class="outline-3">
<h3 id="org92f4a76"><span class="underline">Function Macros</span></h3>
<div class="outline-text-3" id="text-org92f4a76">
<p>
C has a concept of <a href="https://en.wikipedia.org/wiki/Macro_(computer_science)#Parameterized_and_parameterless_macro">function macros</a>, which are able to accept parameters and even return values. We don&rsquo;t want our macro to accept any parameters, but it would be nice if it could return one. The whole goal of moving our template engine to a macro system is to make it easier on our users. Macros will allow us to do type inference on our variables!
</p>

<p>
A basic function macro in C takes the following form&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">MAX</span>(<span style="color: #85DDFF;">a</span>, <span style="color: #85DDFF;">b</span>) ((a) &gt; (b) ? (a) : (b))
</pre>
</div>

<p>
<code>A</code> and <code>B</code> are the parameters of our function. We then make a comparison between the 2 variables, and returns the larger of the two. You may notice that we don&rsquo;t have an explicit <code>return</code> in the macro. How does that work?
</p>

<p>
Macros (and all the C preprocessor) run during compile time. The compiler generates a normal C code depending on the argument that are being passed. If the values are known entirely at compiler time then it can simply substitute the higher value. Otherwise, it will generate a simple ternary to find the larger of the 2 values.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>(<span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">argc</span>, <span style="color: #35CDAF;">char</span> **<span style="color: #85DDFF;">argv</span>) {
  <span style="color: #35CDAF;">bool</span> <span style="color: #85DDFF;">res</span> = MAX(argc, <span style="color: #B5CEA8; font-weight: bold;">4</span>);
}
</pre>
</div>

<p>
Expanding the code above using <code>-e</code> will give us the following expanded code.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>(<span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">argc</span>, <span style="color: #35CDAF;">char</span> **<span style="color: #85DDFF;">argv</span>) {
 <span style="color: #35CDAF;">_Bool</span> <span style="color: #85DDFF;">res</span> = ((argc) &gt; (<span style="color: #B5CEA8; font-weight: bold;">4</span>) ? (argc) : (<span style="color: #B5CEA8; font-weight: bold;">4</span>));
}
</pre>
</div>

<p>
The macro gets inlined into a single ternary. Would we be able to use something like this to implement our template engine? Of course! Our macro will return a pointer to the buffer that it allocated.
</p>
</div>
</div>
<div id="outline-container-org4959495" class="outline-3">
<h3 id="org4959495"><span class="underline">Type Inference</span></h3>
<div class="outline-text-3" id="text-org4959495">
<p>
C doesn&rsquo;t have type inference (well now it <a href="https://thephd.dev/c23-is-coming-here-is-what-is-on-the-menu#n3006--n3007---type-inference-for-object-definitions">does</a>), but even if it did, this wouldn&rsquo;t allow us to omit format specifiers from our templates. Instead, we will use <code>_Generic</code> to print a variable based on its type. You may have seen <a href="c_generics.html">this article</a> where we explored <code>_Generic</code> in C. We covered some more esoteric uses cases there. Here we will cover a more realistic use case.
</p>

<p>
It will be a simple function that chooses which format specifier to pass to <code>sprintf</code> based on the type of the variable being passed in. The great thing is that our users will still be able to use a custom format specifier if they desire.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb377871" class="outline-2">
<h2 id="orgb377871"><span class="underline">Implementation</span></h2>
<div class="outline-text-2" id="text-orgb377871">
<p>
We will take the same approach as before parsing out a template, and then generating C code to rebuild that template at runtime. We can start by building our the skeleton of our marco, and seeing how we can get that working.
</p>
</div>
