template_macros.org
** _Macro Declaration_

#+begin_src C
#define index_html() ({\
  char *output_buffer = malloc(10000); \
  do {\
    char *ob_ptr = output_buffer; \
    // ....
    // template code here
    // ....
  } while (0); \
  output_buffer;\
})
#+end_src

Since macros are just simple text substitutions we cannot create a regular looking function in C. This whole block of code we created has to end each line with ~\~, which continues the previous line without a line break. We've essentially created a single line function that has hundreds of lines of code. Why you may ask?

Well, the macro needs to "value", and macros can't return values in the normal sense. As we saw above with ~MAX~, "returning" a value means that the entire thing evaluates to that value. Our macro needs to return a pointer to the buffer we've built up, so the entire "right-hand side" will evaluate to ~output_buffer~.

We will start be reworking our original code to output macro syntax, instead of function syntax.

#+begin_src C
char *template_to_macro(const char *const file, bool include) {
  FILE *fp = fopen(file, "r");
  if (!fp) {
    if (errno == ENOENT) {
      fprintf(stderr, "error: File \"%s\" does not exist.\n", file);
    } else if (errno == EMFILE) {
      fprintf(stderr,
              "error: Too many open files, do you have a circular import?\n");
    } else {
      perror("fopen");
    }
    return NULL;
  }

  char *macro_buffer = calloc(1, 10000);
  char *mb_ptr = macro_buffer;

  if (!include) {
    char *const filename = convert_filename(file);
    filename[0] = 'd';
    mb_ptr += sprintf(mb_ptr, "#define %s()({\\\n", filename);
    mb_ptr += sprintf(mb_ptr, "\tchar *output_buffer = malloc(%d);\\\n", OUTPUT_BUF_SIZE);
    mb_ptr += sprintf(mb_ptr, "\tdo {\\\n");
    mb_ptr += sprintf(mb_ptr, "\t\tchar *ob_ptr = output_buffer;\\\n");
    free(filename);
  }

  char *input_line = NULL;
  size_t size;
  size_t line_number = 0;
  int read = 0;
  int pos = 0;

  // Parsing code will go here
  // ....

  if (!include) {
    mb_ptr += sprintf(mb_ptr, "\t} while (0); \\\n");
    mb_ptr += sprintf(mb_ptr, "\toutput_buffer;\\\n");
    mb_ptr += sprintf(mb_ptr, "})");
  }

  fclose(fp);
  return macro_buffer;
}
#+end_src

Notice here that we won't have to worry about keeping track of parameters, so we can create the macro entirely within this one function. We only want to output the macro definition once, which only happens if ~include~ is ~false~. A similar version of our parsing code will be sandwiched in the middle. Lastly, we add the closing section of the macro.

There is one curious thing going on around the body of our macro, a ~do-while loop~. We use this to ensure that our code is executed properly within a macro, even if the macro is used within complex control flow blocks. Let's look at the code this generates for us.

#+begin_src C
#define index_html()({\
	char *output_buffer = malloc(10000);\
	do {\
		char *ob_ptr = output_buffer;\
	} while (0); \
	output_buffer;\
})
#+end_src

Great! We now have the outer portion of our macro, the only thing left to do is fill in the body to do something useful.

*** Memory Management
As a bit of an aside, this practice of allocating memory within a macro and returning a pointer to the memory is quite error-prone in C. We are relying on our users understanding how the macro works, and that they will free the memory themselves.

If we wanted to create a more "C style" interface we could accept a pointer to a block of memory, and then branch on if that is a pointer to ~NULL~ or not. If they passed us a pointer to ~NULL~ we would allocate a buffer for them, otherwise we would use the buffer they gave us a pointer to. It would be a fairly easy change to make if you would like to.

Here we just need to make our users aware that the memory address returned from ~index_html()~ must be freed. We can do this with generated documentation comments that will pop up in an LSP, or if they jump to definition.

#+begin_src C
  if (!include) {
    char *const filename = convert_filename(file);
    mb_ptr += sprintf(mb_ptr, "// GENERATED FUNCTION from file %s\n", file);
    mb_ptr += sprintf(mb_ptr, "// Memory returned by %s is heap allocated, and must be freed\n", filename);
    mb_ptr += sprintf(mb_ptr, "#define %s()({\\\n", filename);
    mb_ptr += sprintf(mb_ptr, "\tchar *output_buffer = malloc(%d);\\\n", OUTPUT_BUF_SIZE);
    mb_ptr += sprintf(mb_ptr, "\tdo {\\\n");
    mb_ptr += sprintf(mb_ptr, "\t\tchar *ob_ptr = output_buffer;\\\n");
    free(filename);
  }
#+end_src

#+begin_src C
// GENERATED FUNCTION from file index.html
// Memory returned by index_html is heap allocated, and must be freed
#define index_html()({\
	char *output_buffer = malloc(10000);\
	do {\
		char *ob_ptr = output_buffer;\
	} while (0); \
	output_buffer;\
})
#+end_src

