template_macros.html
<div id="outline-container-org9eab191" class="outline-3">
<h3 id="org9eab191"><span class="underline">Macro Declaration</span></h3>
<div class="outline-text-3" id="text-org9eab191">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">index_html</span>() ({\
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output_buffer</span> = malloc(<span style="color: #B5CEA8; font-weight: bold;">10000</span>); \
  <span style="color: #339CDB;">do</span> {\
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">ob_ptr</span> = output_buffer; \
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">template code here</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
  } <span style="color: #339CDB;">while</span> (<span style="color: #B5CEA8; font-weight: bold;">0</span>); \
  output_buffer;\
})
</pre>
</div>

<p>
Since macros are just simple text substitutions we cannot create a regular looking function in C. This whole block of code we created has to end each line with <code>\</code>, which continues the previous line without a line break. We&rsquo;ve essentially created a single line function that has hundreds of lines of code. Why you may ask?
</p>

<p>
Well, the macro needs to &ldquo;value&rdquo;, and macros can&rsquo;t return values in the normal sense. As we saw above with <code>MAX</code>, &ldquo;returning&rdquo; a value means that the entire thing evaluates to that value. Our macro needs to return a pointer to the buffer we&rsquo;ve built up, so the entire &ldquo;right hand side&rdquo; will evaluate to <code>output_buffer</code>.
</p>

<p>
We will start be reworking our original code to output macro syntax, instead of function syntax.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">char</span> *<span style="color: #D9DAA2;">template_to_macro</span>(<span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span> *<span style="color: #339CDB;">const</span> <span style="color: #85DDFF;">file</span>, <span style="color: #35CDAF;">bool</span> <span style="color: #85DDFF;">include</span>) {
  <span style="color: #35CDAF;">FILE</span> *<span style="color: #85DDFF;">fp</span> = fopen(file, <span style="color: #DB8E73;">"r"</span>);
  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>fp) {
    <span style="color: #339CDB;">if</span> (errno == ENOENT) {
      fprintf(stderr, <span style="color: #DB8E73;">"error: File \"%s\" does not exist.\n"</span>, file);
    } <span style="color: #339CDB;">else</span> <span style="color: #339CDB;">if</span> (errno == EMFILE) {
      fprintf(stderr,
              <span style="color: #DB8E73;">"error: Too many open files, do you have a circular import?\n"</span>);
    } <span style="color: #339CDB;">else</span> {
      perror(<span style="color: #DB8E73;">"fopen"</span>);
    }
    <span style="color: #339CDB;">return</span> <span style="color: #339CDB;">NULL</span>;
  }

  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">macro_buffer</span> = calloc(<span style="color: #B5CEA8; font-weight: bold;">1</span>, <span style="color: #B5CEA8; font-weight: bold;">10000</span>);
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">mb_ptr</span> = macro_buffer;

  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>include) {
    <span style="color: #35CDAF;">char</span> *<span style="color: #339CDB;">const</span> <span style="color: #85DDFF;">filename</span> = convert_filename(file);
    filename[<span style="color: #B5CEA8; font-weight: bold;">0</span>] = <span style="color: #DB8E73;">'d'</span>;
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"#define %s()({\\\n"</span>, filename);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\tchar *output_buffer = malloc(%d);\\\n"</span>, OUTPUT_BUF_SIZE);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\tdo {\\\n"</span>);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t\tchar *ob_ptr = output_buffer;\\\n"</span>);
    free(filename);
  }

  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">input_line</span> = <span style="color: #339CDB;">NULL</span>;
  <span style="color: #35CDAF;">size_t</span> <span style="color: #85DDFF;">size</span>;
  <span style="color: #35CDAF;">size_t</span> <span style="color: #85DDFF;">line_number</span> = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
  <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">read</span> = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
  <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">pos</span> = <span style="color: #B5CEA8; font-weight: bold;">0</span>;

  <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Parsing code will go here</span>
  <span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>

  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>include) {
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t} while (0); \\\n"</span>);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\toutput_buffer;\\\n"</span>);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"})"</span>);
  }

  fclose(fp);
  <span style="color: #339CDB;">return</span> macro_buffer;
}
</pre>
</div>

<p>
Notice here that we won&rsquo;t have to worry about keeping track of parameters, so we can create the macro entirely within this one function. We only want to output the macro definition once, which only happens if <code>include</code> is <code>false</code>. A similar version of our parsing code will be sandwiched in the middle. Lastly, we add the closing section of the macro.
</p>

<p>
There is one curious thing going on around the body of our macro, a <code>do-while loop</code>. We use this to ensure that our code is executed properly within a macro, even if the macro is used within complex control flow blocks. Let&rsquo;s look at the code this generates for us.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">index_html</span>()({\
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output_buffer</span> = malloc(<span style="color: #B5CEA8; font-weight: bold;">10000</span>);\
    <span style="color: #339CDB;">do</span> {\
        <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">ob_ptr</span> = output_buffer;\
    } <span style="color: #339CDB;">while</span> (<span style="color: #B5CEA8; font-weight: bold;">0</span>); \
    output_buffer;\
})
</pre>
</div>

<p>
Great! We now have the outer porition of our macro, the only thing left to do is fill in the body to do something useful.
</p>
</div>
<div id="outline-container-orge5912d2" class="outline-4">
<h4 id="orge5912d2">Memory Management</h4>
<div class="outline-text-4" id="text-orge5912d2">
<p>
As a bit of an aside, this practice of allocating memory within a macro and returning a pointer to the memory is quite error prone in C. We are relying on our users understanding how the macro works, and that they will free the memory themselves.
</p>

<p>
If we wanted to create a more &ldquo;C style&rdquo; interface we could accept a pointer to a block of memory, and then branch on if that is a pointer to <code>NULL</code> or not. If they passed us a pointer to <code>NULL</code> we would allocate a buffer for them, otherwise we would use the buffer they gave us a pointer to. It would be a fairly easy change to make if you would like to.
</p>

<p>
Here we just need to make our users aware that the memory address returned from <code>index_html()</code> must be freed. We can do this with generated documentation comments that will pop up in an LSP, or if they jump to definition.
</p>

<div class="org-src-container">
<pre class="src src-C">  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>include) {
    <span style="color: #35CDAF;">char</span> *<span style="color: #339CDB;">const</span> <span style="color: #85DDFF;">filename</span> = convert_filename(file);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"// GENERATED FUNCTION from file %s\n"</span>, file);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"// Memory returned by %s is heap allocated, and must be freed\n"</span>, filename);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"#define %s()({\\\n"</span>, filename);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\tchar *output_buffer = malloc(%d);\\\n"</span>, OUTPUT_BUF_SIZE);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\tdo {\\\n"</span>);
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t\tchar *ob_ptr = output_buffer;\\\n"</span>);
    free(filename);
  }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">GENERATED FUNCTION from file index.html</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Memory returned by index_html is heap allocated, and must be freed</span>
<span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">index_html</span>()({\
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output_buffer</span> = malloc(<span style="color: #B5CEA8; font-weight: bold;">10000</span>);\
    <span style="color: #339CDB;">do</span> {\
        <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">ob_ptr</span> = output_buffer;\
    } <span style="color: #339CDB;">while</span> (<span style="color: #B5CEA8; font-weight: bold;">0</span>); \
    output_buffer;\
})
</pre>
</div>
</div>
</div>
</div>
