template_macros.org
** _Parsing Logic_
The core of our parser will remain the same, we will just need to modify the code that it generates. Our first section of detecting lines of code or includes has the same structure. The only change needed is outputting a ~\~ at the end of the line to keep the macro valid.

#+begin_src C
  while ((read = getline(&input_line, &size, fp)) != -1) {
    char *line = input_line;
    trim_newline(line, read);
    line_number++;

    if ((pos = code_line_p(line)) != -1) {
      if (include_p(&line[pos])) {
        size_t include_indent =
            (&line[pos] - line) / 4; // Calculate indentation
        line += pos + 9;             // skip past @include{"
        strtok(line, "\"");          // null terminate filename

        char *parsed_file =
            template_to_macro(line, indent_level + include_indent, true);
        if (!parsed_file) {
          fprintf(stderr, "error: %10s:%-5ld failed while importing \"%s\"\n",
                  file, line_number, line);
          free(input_line);
          free(macro_buffer);
          return NULL;
        }
        mb_ptr = stpcpy(mb_ptr, parsed_file);
        free(parsed_file);
        continue;
      }
      mb_ptr += sprintf(mb_ptr, "\t\t%s \\\n", &line[pos]);
      continue;
    }
    // Continued below
    // ....
#+end_src

The next segment of parsing out lines and variables has one slight change, we no longer need to track parameters explicitly. Instead, we will take in the variable name, and format specifier, placing those directly in our macro.

#+begin_src C
// ....
    mb_ptr += sprintf(
        mb_ptr, "\t\tob_ptr += sprintf(ob_ptr, \"%%s\", \"%s\"); \\\n",
        indent);
    char temp[500] = {0};
    int temp_pos = 0;
    bool inside_variable = false;
    while (*line) {
      if (*line == '$' && *(line + 1) && *(line + 1) == '{') {
        inside_variable = true;
        // Write out line before variable decl
        if (temp_pos > 0) {
          mb_ptr += sprintf(
              mb_ptr,
              "\t\tob_ptr += sprintf(ob_ptr, \"%%s\", \"%s\"); \\\n",
              temp);
          temp[0] = '\0';
          temp_pos = 0;
        }
        line += 2;
      } else if (inside_variable) {
// Continued below
// ....
#+end_src

We first indent the output line by printing the correct number of tab characters. A temporary buffer is created to store characters as we parse along the line. Just like we did before we check to see if our position matches the character sequence ~${~. If it does, we write out everything before the variable block, and then continue the loop.

Notice again that we're using ~\\\n~ to end each line which translates to ~\~ and ~\n~ in the final output. Which will properly end each line of our macro, and move on to the next line.

#+begin_src C
// ....
      } else if (inside_variable) {
        while (*line && *line != ':') {
          temp[temp_pos++] = *line++;
        }
        if (!*line) {
          temp[temp_pos] = '\0';
          fprintf(stderr,
                  "error: %10s:%-5ld malformed variable block around \"%s\" "
                  "hint: ${variable:%%s} \n",
                  file, line_number, temp);
          free(macro_buffer);
          free(input_line);
          return NULL;
        }
        temp[temp_pos++] = '\0';
        line++;
        char *fmt = &temp[temp_pos];
        while (*line && *line != '}') {
          temp[temp_pos++] = *line++;
        }
        temp[temp_pos] = '\0';
        if (!*line || strlen(fmt) == 0) {
          fprintf(stderr,
                  "error: %10s:%-5ld missing format specifier for \"%s\" "
                  "hint: ${variable:%%s} \n",
                  file, line_number, temp);
          free(macro_buffer);
          free(input_line);
          return NULL;
        }
        mb_ptr +=
            sprintf(mb_ptr, "\t\tob_ptr += sprintf(ob_ptr, \"%s\", %s); \\\n",
                    fmt, temp);
        temp[0] = '\0';
        temp_pos = 0;
        inside_variable = false;
        line++;
      } else {
// Continued below
// ....
#+end_src

This section is where things change the most, as we no longer have to be concerned with keeping track of parameters, or differentiating between parameters and local variables. Instead, we scan along for the variable name, and then its format specifier. The error checking is done along the way to ensure that a malformed variable block is caught and correctly reported to the user.

Once we have found a valid variable block we go ahead and write it out to our macro, substituting in the user specified format string, and variable name.

#+begin_src C
// ....
      } else {
        if (*line == '"') {
          temp[temp_pos++] = '\\';
        }
        temp[temp_pos++] = *line++;
        temp[temp_pos] = '\0';
      }
    }
    temp[temp_pos] = '\0';
    mb_ptr += sprintf(mb_ptr, "\t\tob_ptr += sprintf(ob_ptr, \"%%s\\n\", \"%s\"); \\\n", temp);
  }

  if (!include) {
    mb_ptr += sprintf(mb_ptr, "\t} while (0); \\\n");
// ....
// Remaining function body below
#+end_src

The last case is a normal character in our line. In that case we first escape it, and then add it to our buffer. Once we reach the end of a line we write it out to the buffer, making sure to include a newline in this ~sprintf~ call to ensure the output text file moves to the next line.

That should be all the code we need to generate a macro that runs out template code. I made a slight modification to main now that it may return ~NULL~.

#+begin_src C
int main(int argc, char **argv) {
  char *output = template_to_macro("index.html", 0, false);
  if (!output) {
    return 1;
  }
  puts(output);
  free(output);
}
#+end_src

Great, now let's see the macro that it generates, along with the resulting html file.

#+begin_src C
// GENERATED FUNCTION from file index.html
// Memory returned by index_html is heap allocated, and must be freed
#define index_html()({\
	char *output_buffer = malloc(10000);\
	do {\
		char *ob_ptr = output_buffer;\
		ob_ptr += sprintf(ob_ptr, "%s", ""); \
		ob_ptr += sprintf(ob_ptr, "%s\n", "<!doctype html>"); \
        // ....
		ob_ptr += sprintf(ob_ptr, "%s\n", "</html>"); \
	} while (0); \
	output_buffer;\
})
#+end_src

Then if we can include this code in a separate file and run the template.

#+begin_src C
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "templates.h"


int main() {
  char *testing = "this is a testing value";
  char *name = "Jackson";
  char *last_name = "Mowry";
  puts(index_html());
}
#+end_src

As we can now see, our template no longer requires passing in each variable! The code still requires that all the referenced variables be present in the scope the macro is run, so we still have type safety, and safety that a variable is present.

If we forget to include a variable in the scope, or pass a variable with the wrong type but the same name, the code will refuse to compile or generate a warning.

#+begin_src html
<!doctype html>
<html class="no-js" lang="">
    <head>
        <meta charset="utf-8">
        <link>this is a testing value</link>
        <style>
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        </style>
    </head>
    <body>
        <div>Hi Mom! My name is Jackson Mowry</div>
            <div>0</div>
            <div>1</div>
            <div>2</div>
            <div>3</div>
            <div>4</div>
            <div>5</div>
            <div>6</div>
            <div>7</div>
            <div>8</div>
            <div>9</div>

        5.656854
    </body>
</html>

#+end_src

