template_macros.html
<div id="outline-container-org8c1a2d7" class="outline-3">
<h3 id="org8c1a2d7"><span class="underline">Parsing Logic</span></h3>
<div class="outline-text-3" id="text-org8c1a2d7">
<p>
The core of our parser will remain the same, we will just need to modify the code that it generates. Our first section of detecting lines of code or includes has the same structure. The only change needed is outputting a <code>\</code> at the end of the line to keep the macro valid.
</p>

<div class="org-src-container">
<pre class="src src-C">  <span style="color: #339CDB;">while</span> ((read = getline(&amp;input_line, &amp;size, fp)) != -<span style="color: #B5CEA8; font-weight: bold;">1</span>) {
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">line</span> = input_line;
    trim_newline(line, read);
    line_number++;

    <span style="color: #339CDB;">if</span> ((pos = code_line_p(line)) != -<span style="color: #B5CEA8; font-weight: bold;">1</span>) {
      <span style="color: #339CDB;">if</span> (include_p(&amp;line[pos])) {
        <span style="color: #35CDAF;">size_t</span> <span style="color: #85DDFF;">include_indent</span> =
            (&amp;line[pos] - line) / <span style="color: #B5CEA8; font-weight: bold;">4</span>; <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Calculate indentation</span>
        line += pos + <span style="color: #B5CEA8; font-weight: bold;">9</span>;             <span style="color: #579C4C;">// </span><span style="color: #579C4C;">skip past @include{"</span>
        strtok(line, <span style="color: #DB8E73;">"\""</span>);          <span style="color: #579C4C;">// </span><span style="color: #579C4C;">null terminate filename</span>

        <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">parsed_file</span> =
            template_to_macro(line, indent_level + include_indent, <span style="color: #339CDB;">true</span>);
        <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>parsed_file) {
          fprintf(stderr, <span style="color: #DB8E73;">"error: %10s:%-5ld failed while importing \"%s\"\n"</span>,
                  file, line_number, line);
          free(input_line);
          free(macro_buffer);
          <span style="color: #339CDB;">return</span> <span style="color: #339CDB;">NULL</span>;
        }
        mb_ptr = stpcpy(mb_ptr, parsed_file);
        free(parsed_file);
        <span style="color: #339CDB;">continue</span>;
      }
      mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t\t%s \\\n"</span>, &amp;line[pos]);
      <span style="color: #339CDB;">continue</span>;
    }
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Continued below</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
</pre>
</div>

<p>
The next segment of parsing out lines and variables has one slight change, we no longer need to track parameters explicitly. Instead we will take in the variable name, and format specifier, placing those directly in our macro.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
    mb_ptr += sprintf(
        mb_ptr, <span style="color: #DB8E73;">"\t\tob_ptr += sprintf(ob_ptr, \"%%s\", \"%s\"); \\\n"</span>,
        indent);
    <span style="color: #35CDAF;">char</span> <span style="color: #85DDFF;">temp</span>[<span style="color: #B5CEA8; font-weight: bold;">500</span>] = {<span style="color: #B5CEA8; font-weight: bold;">0</span>};
    <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">temp_pos</span> = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
    <span style="color: #35CDAF;">bool</span> <span style="color: #85DDFF;">inside_variable</span> = <span style="color: #339CDB;">false</span>;
    <span style="color: #339CDB;">while</span> (*line) {
      <span style="color: #339CDB;">if</span> (*line == <span style="color: #DB8E73;">'$'</span> &amp;&amp; *(line + <span style="color: #B5CEA8; font-weight: bold;">1</span>) &amp;&amp; *(line + <span style="color: #B5CEA8; font-weight: bold;">1</span>) == <span style="color: #DB8E73;">'{'</span>) {
        inside_variable = <span style="color: #339CDB;">true</span>;
        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Write out line before variable decl</span>
        <span style="color: #339CDB;">if</span> (temp_pos &gt; <span style="color: #B5CEA8; font-weight: bold;">0</span>) {
          mb_ptr += sprintf(
              mb_ptr,
              <span style="color: #DB8E73;">"\t\tob_ptr += sprintf(ob_ptr, \"%%s\", \"%s\"); \\\n"</span>,
              temp);
          temp[<span style="color: #B5CEA8; font-weight: bold;">0</span>] = <span style="color: #DB8E73;">'\0'</span>;
          temp_pos = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
        }
        line += <span style="color: #B5CEA8; font-weight: bold;">2</span>;
      } <span style="color: #339CDB;">else</span> <span style="color: #339CDB;">if</span> (inside_variable) {
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Continued below</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
</pre>
</div>

<p>
We first indent the output line by printing the correct number of tab characters. A temporary buffer is created to store characters as we parse along the line. Just like we did before we check to see if the our position matches the character sequence <code>${</code>. If it does we write out everything before the variable block, and then continue the loop.
</p>

<p>
Notice again that we&rsquo;re using <code>\\\n</code> to end each line which translates to <code>\</code> and <code>\n</code> in the final output. Which will properly end each line of our macro, and move on to the next line.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
      } <span style="color: #339CDB;">else</span> <span style="color: #339CDB;">if</span> (inside_variable) {
        <span style="color: #339CDB;">while</span> (*line &amp;&amp; *line != <span style="color: #DB8E73;">':'</span>) {
          temp[temp_pos++] = *line++;
        }
        <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>*line) {
          temp[temp_pos] = <span style="color: #DB8E73;">'\0'</span>;
          fprintf(stderr,
                  <span style="color: #DB8E73;">"error: %10s:%-5ld malformed variable block around \"%s\" "</span>
                  <span style="color: #DB8E73;">"hint: ${variable:%%s} \n"</span>,
                  file, line_number, temp);
          free(macro_buffer);
          free(input_line);
          <span style="color: #339CDB;">return</span> <span style="color: #339CDB;">NULL</span>;
        }
        temp[temp_pos++] = <span style="color: #DB8E73;">'\0'</span>;
        line++;
        <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">fmt</span> = &amp;temp[temp_pos];
        <span style="color: #339CDB;">while</span> (*line &amp;&amp; *line != <span style="color: #DB8E73;">'}'</span>) {
          temp[temp_pos++] = *line++;
        }
        temp[temp_pos] = <span style="color: #DB8E73;">'\0'</span>;
        <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>*line || strlen(fmt) == <span style="color: #B5CEA8; font-weight: bold;">0</span>) {
          fprintf(stderr,
                  <span style="color: #DB8E73;">"error: %10s:%-5ld missing format specifier for \"%s\" "</span>
                  <span style="color: #DB8E73;">"hint: ${variable:%%s} \n"</span>,
                  file, line_number, temp);
          free(macro_buffer);
          free(input_line);
          <span style="color: #339CDB;">return</span> <span style="color: #339CDB;">NULL</span>;
        }
        mb_ptr +=
            sprintf(mb_ptr, <span style="color: #DB8E73;">"\t\tob_ptr += sprintf(ob_ptr, \"%s\", %s); \\\n"</span>,
                    fmt, temp);
        temp[<span style="color: #B5CEA8; font-weight: bold;">0</span>] = <span style="color: #DB8E73;">'\0'</span>;
        temp_pos = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
        inside_variable = <span style="color: #339CDB;">false</span>;
        line++;
      } <span style="color: #339CDB;">else</span> {
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Continued below</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
</pre>
</div>

<p>
This section is where things change the most, as we no longer have to be concerned with keeping track of parameters, or differentiating between parameters and local variables. Instead, we scan along for the variable name, and then its format specifier. The error checking is done along the way to ensure that a malformed variable block is caught and correctly reported to the user.
</p>

<p>
Once we have found a valid variable block we go ahead and write it out to our macro, substituting in the user specified format string, and variable name.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
      } <span style="color: #339CDB;">else</span> {
        <span style="color: #339CDB;">if</span> (*line == <span style="color: #DB8E73;">'"'</span>) {
          temp[temp_pos++] = <span style="color: #DB8E73;">'\\'</span>;
        }
        temp[temp_pos++] = *line++;
        temp[temp_pos] = <span style="color: #DB8E73;">'\0'</span>;
      }
    }
    <span style="color: #35CDAF;">temp</span>[temp_pos] = <span style="color: #DB8E73;">'\0'</span>;
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t\tob_ptr += sprintf(ob_ptr, \"%%s\\n\", \"%s\"); \\\n"</span>, temp);
  }

  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>include) {
    mb_ptr += sprintf(mb_ptr, <span style="color: #DB8E73;">"\t} while (0); \\\n"</span>);
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Remaining function body below</span>
</pre>
</div>

<p>
The last case is a normal character in our line. In that case we first escape it, and then add it to our buffer. Once we reach the end of a line we write it out to the buffer, making sure to include a newline in this <code>sprintf</code> call to ensure the output text file moves to the next line.
</p>

<p>
That should be all the code we need to generate a macro that runs out template code. I made a slight modification to main now that it may return <code>NULL</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>(<span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">argc</span>, <span style="color: #35CDAF;">char</span> **<span style="color: #85DDFF;">argv</span>) {
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output</span> = template_to_macro(<span style="color: #DB8E73;">"index.html"</span>, <span style="color: #B5CEA8; font-weight: bold;">0</span>, <span style="color: #339CDB;">false</span>);
  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>output) {
    <span style="color: #339CDB;">return</span> <span style="color: #B5CEA8; font-weight: bold;">1</span>;
  }
  puts(output);
  free(output);
}
</pre>
</div>

<p>
Great, now let&rsquo;s see the macro that it generates, along with the resulting html file.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">GENERATED FUNCTION from file index.html</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Memory returned by index_html is heap allocated, and must be freed</span>
<span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">index_html</span>()({\
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output_buffer</span> = malloc(<span style="color: #B5CEA8; font-weight: bold;">10000</span>);\
    <span style="color: #339CDB;">do</span> {\
        <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">ob_ptr</span> = output_buffer;\
        ob_ptr += sprintf(ob_ptr, <span style="color: #DB8E73;">"%s"</span>, <span style="color: #DB8E73;">""</span>); \
        ob_ptr += sprintf(ob_ptr, <span style="color: #DB8E73;">"%s\n"</span>, <span style="color: #DB8E73;">"&lt;!doctype html&gt;"</span>); \
        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
        ob_ptr += sprintf(ob_ptr, <span style="color: #DB8E73;">"%s\n"</span>, <span style="color: #DB8E73;">"&lt;/html&gt;"</span>); \
    } <span style="color: #339CDB;">while</span> (<span style="color: #B5CEA8; font-weight: bold;">0</span>); \
    output_buffer;\
})
</pre>
</div>

<p>
Then if we can include this code in a separate file and run the template.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;stdio.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;stdlib.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;math.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">"templates.h"</span>


<span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>() {
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">testing</span> = <span style="color: #DB8E73;">"this is a testing value"</span>;
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">name</span> = <span style="color: #DB8E73;">"Jackson"</span>;
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">last_name</span> = <span style="color: #DB8E73;">"Mowry"</span>;
  puts(index_html());
}
</pre>
</div>

<p>
As we can now see, out template no longer requires passing in each variable! The code still requires that all of the referenced variables be present in the scope the macro is run, so we still have type safety, and safety that a variable is present.
</p>

<p>
If we forget to include a variable in the scope, or pass a variable with the wrong type but the same name, the code will refuse to compile or generate a warning.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #339CDB;">!doctype</span> html&gt;
&lt;<span style="color: #D9DAA2;">html</span> <span style="color: #85DDFF;">class</span>=<span style="color: #DB8E73;">"no-js"</span> <span style="color: #85DDFF;">lang</span>=<span style="color: #DB8E73;">""</span>&gt;
    &lt;<span style="color: #D9DAA2;">head</span>&gt;
        &lt;<span style="color: #D9DAA2;">meta</span> <span style="color: #85DDFF;">charset</span>=<span style="color: #DB8E73;">"utf-8"</span>&gt;
        &lt;<span style="color: #D9DAA2;">link</span>&gt;this is a testing value&lt;/<span style="color: #D9DAA2;">link</span>&gt;
        &lt;<span style="color: #D9DAA2;">style</span>&gt;
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        &lt;/<span style="color: #D9DAA2;">style</span>&gt;
    &lt;/<span style="color: #D9DAA2;">head</span>&gt;
    &lt;<span style="color: #D9DAA2;">body</span>&gt;
        &lt;<span style="color: #D9DAA2;">div</span>&gt;Hi Mom! My name is Jackson Mowry&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;0&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;1&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;2&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;3&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;4&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;5&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;6&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;7&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;8&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;9&lt;/<span style="color: #D9DAA2;">div</span>&gt;

        5.656854
    &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;

</pre>
</div>
</div>
</div>
