template_macros.org
** _Wrapping ~template_to_macro~_
That is significantly less code than generating a function, and it is even easier to use than a function. We'll probably want to wrap it up in a neat little CLI to match the functionality of the previous version.

#+begin_src C
int main(int argc, char **argv) {
  FILE *fp = fopen("templates.h", "w");
  if (!fp) {
    perror("fopen");
    exit(1);
  }

  fprintf(fp, "%s\n", "#include <stdio.h>");
  fprintf(fp, "%s\n", "#include <stdlib.h>");

  for (int i = 1; i < argc; i++) {
    puts(argv[i]);
    char *output = template_to_macro(argv[i], 0, false);
    if (!output) {
      fprintf(stderr, "error: %16s failed while creating template for %s\n", " ", argv[i]);
      return 1;
    }
    fprintf(fp, "%s\n", output);
    free(output);
  }
}
#+end_src

Nothing too fancy, just making it a bit easier to use on the CLI. We can flush this out later to add more error handling and hints to our user.

* _Type Inference and Generics_
We have created a much easier to use interface for our users, removing the need to differentiate between local variables and function parameters, and resolving variables from local scope. Wouldn't it be nice to allow our users to omit the format specifier all together?

Luckily, thanks to ~_Generic~ in C we should be able to do this fairly easily.

** _~print_generic~ and ~print_value~_
Our first step will be to create a ~_Generic~ macro that can choose which version of ~sprintf~ to call based on the type it is presented with. ~_Generic~ was introduced in C11 and has still not seen widespread usage.

One of the big downsides with generics in C is that it cannot do any code generation for you. It essentially just allows for function overloading, which isn't normally available in C. In our case we essentially want to "switch" on the type of the variable we are given, and pass the appropriate format string to ~sprintf~.

#+begin_src C
#define print_generic(value) _Generic((value), \
   char: "%c", \
   char*: "%s", \
   const char*: "%s", \
   float: "%.2f", \
   double: "%.2f", \
   signed char: "%d", \
   unsigned char: "%u", \
   signed short: "%d", \
   unsigned short: "%u", \
   signed int: "%d", \
   unsigned int: "%u", \
   signed long: "%ld", \
   unsigned long: "%lu", \
   signed long long: "%lld", \
   unsigned long long: "%llu" \
)

#define print_value(buf, value) ({ \
    int result = sprintf(buf, print_generic(value), value);\
    result; \
})
#+end_src

These are the 2 macros that we need to include in our final output.

~print_generic~ takes in any primitive value, and passes the correct format string to ~sprintf~. We only want our users to print out primitive values here to not complicate our logic more than necessary. If a user needs to print more complicated types, like structs or containers, they would need to first create a string value that is then passed to our template.

~print_value~ first calls ~print_generic~ to get the appropriate format string, and then outputs the string representation to the provided buffer.

We can't simply just copy and paste this code somewhere in our code and have it run during the generation phase. These macros need to be included in our output so that they are run when the end user compiles their program. Instead, we need to turn these macros into strings that can then be output into the final header file.

#+begin_src C
const char *generic_print_macro =
    "#define print_generic(value) _Generic((value), \\\n"
    "   char: \"%c\", \\\n"
    "   char*: \"%s\", \\\n"
    "   const char*: \"%s\", \\\n"
    "   float: \"%.2f\", \\\n"
    "   double: \"%.2f\", \\\n"
    "   signed char: \"%d\", \\\n"
    "   unsigned char: \"%u\", \\\n"
    "   signed short: \"%d\", \\\n"
    "   unsigned short: \"%u\", \\\n"
    "   signed int: \"%d\", \\\n"
    "   unsigned int: \"%u\", \\\n"
    "   signed long: \"%ld\", \\\n"
    "   unsigned long: \"%lu\", \\\n"
    "   signed long long: \"%lld\", \\\n"
    "   unsigned long long: \"%llu\" \\\n"
    ")\n"
    "\n"
    "#define print_value(buf, value) ({ \\\n"
    "    int result = sprintf(buf, print_generic(value), value);\\\n"
    "    result; \\\n"
    "})\n";
#+end_src

