template_macros.html
<div id="outline-container-org3abd1cd" class="outline-3">
<h3 id="org3abd1cd"><span class="underline">Wrapping <code>template_to_macro</code></span></h3>
<div class="outline-text-3" id="text-org3abd1cd">
<p>
That is significantly less code than generating a function, and it is even easier to use than a function. We&rsquo;ll probably want to wrap it up in a neat little CLI to match the functionality of the previous version.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>(<span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">argc</span>, <span style="color: #35CDAF;">char</span> **<span style="color: #85DDFF;">argv</span>) {
  <span style="color: #35CDAF;">FILE</span> *<span style="color: #85DDFF;">fp</span> = fopen(<span style="color: #DB8E73;">"templates.h"</span>, <span style="color: #DB8E73;">"w"</span>);
  <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>fp) {
    perror(<span style="color: #DB8E73;">"fopen"</span>);
    exit(<span style="color: #B5CEA8; font-weight: bold;">1</span>);
  }

  fprintf(fp, <span style="color: #DB8E73;">"%s\n"</span>, <span style="color: #DB8E73;">"#include &lt;stdio.h&gt;"</span>);
  fprintf(fp, <span style="color: #DB8E73;">"%s\n"</span>, <span style="color: #DB8E73;">"#include &lt;stdlib.h&gt;"</span>);

  <span style="color: #339CDB;">for</span> (<span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">i</span> = <span style="color: #B5CEA8; font-weight: bold;">1</span>; i &lt; argc; i++) {
    puts(argv[i]);
    <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">output</span> = template_to_macro(argv[i], <span style="color: #B5CEA8; font-weight: bold;">0</span>, <span style="color: #339CDB;">false</span>);
    <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>output) {
      fprintf(stderr, <span style="color: #DB8E73;">"error: %16s failed while creating template for %s\n"</span>, <span style="color: #DB8E73;">" "</span>, argv[i]);
      <span style="color: #339CDB;">return</span> <span style="color: #B5CEA8; font-weight: bold;">1</span>;
    }
    fprintf(fp, <span style="color: #DB8E73;">"%s\n"</span>, output);
    free(output);
  }
}
</pre>
</div>

<p>
Nothing too fancy, just making it a bit easier to use on the CLI. We can flush this out later to add more error handling and hints to our user.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb8169f4" class="outline-2">
<h2 id="orgb8169f4"><span class="underline">Type Inference and Generics</span></h2>
<div class="outline-text-2" id="text-orgb8169f4">
<p>
We have created a much easier to use interface for our users, removing the need to differentiate between local variables and function parameters, and resolving variables from local scope. Wouldn&rsquo;t it be nice to allow our users to omit the format specifier all together?
</p>

<p>
Luckily, thanks to <code>_Generic</code> in C we should be able to do this fairly easily.
</p>
</div>
<div id="outline-container-org81ce18e" class="outline-3">
<h3 id="org81ce18e"><span class="underline"><code>print_generic</code> and <code>print_value</code></span></h3>
<div class="outline-text-3" id="text-org81ce18e">
<p>
Our first step will be to create a <code>_Generic</code> macro that can choose which version of <code>sprintf</code> to call based on the type it is presented with. <code>_Generic</code> was introduced in C11 and has still not seen widespread usage.
</p>

<p>
One of the big downsides with generics in C is that it cannot do any code generation for you. It essentially just allows for function overloading, which isn&rsquo;t normally available in C. In our case we essentially want to &ldquo;switch&rdquo; on the type of the variable we are given, and pass the appropriate format string to <code>sprintf</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">print_generic</span>(<span style="color: #85DDFF;">value</span>) _Generic((value), \
   <span style="color: #35CDAF;">char</span>: <span style="color: #DB8E73;">"%c"</span>, \
   <span style="color: #35CDAF;">char</span>*: <span style="color: #DB8E73;">"%s"</span>, \
   <span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span>*: <span style="color: #DB8E73;">"%s"</span>, \
   <span style="color: #35CDAF;">float</span>: <span style="color: #DB8E73;">"%.2f"</span>, \
   <span style="color: #35CDAF;">double</span>: <span style="color: #DB8E73;">"%.2f"</span>, \
   <span style="color: #35CDAF;">signed</span> <span style="color: #35CDAF;">char</span>: <span style="color: #DB8E73;">"%d"</span>, \
   <span style="color: #35CDAF;">unsigned</span> <span style="color: #35CDAF;">char</span>: <span style="color: #DB8E73;">"%u"</span>, \
   <span style="color: #35CDAF;">signed</span> <span style="color: #35CDAF;">short</span>: <span style="color: #DB8E73;">"%d"</span>, \
   <span style="color: #35CDAF;">unsigned</span> <span style="color: #35CDAF;">short</span>: <span style="color: #DB8E73;">"%u"</span>, \
   <span style="color: #35CDAF;">signed</span> <span style="color: #35CDAF;">int</span>: <span style="color: #DB8E73;">"%d"</span>, \
   <span style="color: #35CDAF;">unsigned</span> <span style="color: #35CDAF;">int</span>: <span style="color: #DB8E73;">"%u"</span>, \
   <span style="color: #35CDAF;">signed</span> <span style="color: #35CDAF;">long</span>: <span style="color: #DB8E73;">"%ld"</span>, \
   <span style="color: #35CDAF;">unsigned</span> <span style="color: #35CDAF;">long</span>: <span style="color: #DB8E73;">"%lu"</span>, \
   <span style="color: #35CDAF;">signed</span> <span style="color: #35CDAF;">long</span> <span style="color: #35CDAF;">long</span>: <span style="color: #DB8E73;">"%lld"</span>, \
   <span style="color: #35CDAF;">unsigned</span> <span style="color: #35CDAF;">long</span> <span style="color: #35CDAF;">long</span>: <span style="color: #DB8E73;">"%llu"</span> \
)

<span style="color: #85DDFF; font-weight: bold;">#define</span> <span style="color: #D9DAA2;">print_value</span>(<span style="color: #85DDFF;">buf</span>, <span style="color: #85DDFF;">value</span>) ({ \
    <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">result</span> = sprintf(buf, print_generic(value), value);\
    result; \
})
</pre>
</div>

<p>
These are the 2 macros that we need to include in our final output.
</p>

<p>
<code>print_generic</code> takes in any primative value, and passes the correct format string to <code>sprintf</code>. We only want our users to print out primative values here to not complicate our logic more than necessary. If a user needs to print more complicated types, like structs or containers, they would need to first create a string value that is then passed to out template.
</p>

<p>
<code>print_value</code> first calls <code>print_generic</code> to get the appropriate format string, and then outputs the string representation to the provided buffer.
</p>

<p>
We can&rsquo;t simply just copy paste this code somewhere in our code and have it run during the generation phase. These macros need to be included in our output so that they are run when the end user compiles their program. Instead, we need to turns these macros into strings that can then be output into the final header file.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #339CDB;">const</span> <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">generic_print_macro</span> =
    <span style="color: #DB8E73;">"#define print_generic(value) _Generic((value), \\\n"</span>
    <span style="color: #DB8E73;">"   char: \"%c\", \\\n"</span>
    <span style="color: #DB8E73;">"   char*: \"%s\", \\\n"</span>
    <span style="color: #DB8E73;">"   const char*: \"%s\", \\\n"</span>
    <span style="color: #DB8E73;">"   float: \"%.2f\", \\\n"</span>
    <span style="color: #DB8E73;">"   double: \"%.2f\", \\\n"</span>
    <span style="color: #DB8E73;">"   signed char: \"%d\", \\\n"</span>
    <span style="color: #DB8E73;">"   unsigned char: \"%u\", \\\n"</span>
    <span style="color: #DB8E73;">"   signed short: \"%d\", \\\n"</span>
    <span style="color: #DB8E73;">"   unsigned short: \"%u\", \\\n"</span>
    <span style="color: #DB8E73;">"   signed int: \"%d\", \\\n"</span>
    <span style="color: #DB8E73;">"   unsigned int: \"%u\", \\\n"</span>
    <span style="color: #DB8E73;">"   signed long: \"%ld\", \\\n"</span>
    <span style="color: #DB8E73;">"   unsigned long: \"%lu\", \\\n"</span>
    <span style="color: #DB8E73;">"   signed long long: \"%lld\", \\\n"</span>
    <span style="color: #DB8E73;">"   unsigned long long: \"%llu\" \\\n"</span>
    <span style="color: #DB8E73;">")\n"</span>
    <span style="color: #DB8E73;">"\n"</span>
    <span style="color: #DB8E73;">"#define print_value(buf, value) ({ \\\n"</span>
    <span style="color: #DB8E73;">"    int result = sprintf(buf, print_generic(value), value);\\\n"</span>
    <span style="color: #DB8E73;">"    result; \\\n"</span>
    <span style="color: #DB8E73;">"})\n"</span>;
</pre>
</div>
</div>
</div>
