template_macros.org
** _Modifying the Code Generation_
We need to allow our users to omit the format specifier from their variable blocks, so our parser will need to account for this. While scanning for a variable we need to check if we hit a ~:~ or ~}~ first.

#+begin_src C
// ....
// Previous code above
      } else if (inside_variable) {
        bool generic_variable = false;
        bool parsing_error = false;
        while (*line && *line != ':') {
          if (*line == '}' && strlen(temp) != 0) {
            generic_variable = true;
            break;
          }
          temp[temp_pos++] = *line++;
        }
        if (generic_variable) {
          temp[temp_pos++] = '\0';
          mb_ptr += sprintf(
              mb_ptr, "\t\tob_ptr += print_value(ob_ptr, %s); \\\n", temp);
          temp[0] = '\0';
          temp_pos = 0;
          line++;
          inside_variable = false;
          continue;
        }
        temp[temp_pos++] = '\0';
        if (!*line) {
          parsing_error = true;
// Previous code below
// ....
#+end_src

A new condition ~generic_variable~ is added to track when the user omits a format specifier. After parsing the variable name we check if the variable was considered "generic". This is where our new macro ~print_value~ comes in to print out the variable. We simply output the macro into the generated code, which will then be evaluated once the user compiles their code.

The only other change is to unset ~inside_variable~ and continue on to the next portion of the line. We also make sure to set ~temp_pos~ back to 0 so that if the variable is the last thing on the line we don't accidentally print out garbage data from the temporary buffer afterward.

With those changes in place we should be able to remove all format specifiers from our template.

#+begin_src html
<!doctype html>
<html class="no-js" lang="">
    <head>
        <meta charset="utf-8">
        <link>${testing}</link>
        <style>
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        </style>
    </head>
    <body>
        <div>Hi Mom! My name is ${name} ${last_name}</div>
        @for(int i = 0; i < 10; i++) {
            <div>${i}</div>
        @}

        <pre>
            <!-- @include{"index.md"} -->
        </pre>

        ${sqrt(32)}
    </body>
</html>
#+end_src

Which can then be run just like before, with the types inferred automatically from the local scope.

#+begin_src C
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include "templates.h"

int main() {
  char *testing = "this is a testing value";
  char *name = "Billy";
  char *last_name = "Bob";
  puts(index_html());
}
#+end_src

#+begin_src html
<!doctype html>
<html class="no-js" lang="">
    <head>
        <meta charset="utf-8">
        <link>this is a testing value</link>
        <style>
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        </style>
    </head>
    <body>
        <div>Hi Mom! My name is Billy Bob</div>
            <div>0</div>
            <!-- ........ -->
            <div>9</div>
    </body>
</html>
#+end_src

Isn't that great! We've greatly simplified our user experience, without sacrificing type safety. If the user still wishes to have an explicit "contract" for their template they can specify the format string, and those that aren't concerned can omit it.

You may have also noticed that we can now call functions directly within our variable blocks. Before this wasn't possible because every "variable" needed to actually be a variable that can be found with an identifier. Now we are able to call functions or access struct fields directly within a variable block, further simplifying the job for template authors.

The types are automatically inferred from these values, and our template engine does not need to be concerned with what code is going to be called. That is the beauty and simplicity that comes with providing the primitives to our users and letting them decide what to do with them.

If a function the user wants to call returns a more complex value it is easy to pick out the primitive fields, or even to perform transformations on that data directly within the template. Remember that any line beginning with ~@~ is just a line of C code.

#+begin_src html
<div>
  @my_struct ms = db_query("billy bob");
  <span>${ms.name}</span>
  <span>${ms.age}</span>
</div>
#+end_src

This is not something I would personally recommend doing, but the point is that it is possible. Our design allows users to do anything they would like from within a template, as simple or complex as they would like.

