template_macros.html
<div id="outline-container-org0b1cb06" class="outline-3">
<h3 id="org0b1cb06"><span class="underline">Modifying the Code Generation</span></h3>
<div class="outline-text-3" id="text-org0b1cb06">
<p>
We need to allow our users to omit the format specifier from their variable blocks, so our parser will need to account for this. While scanning for a variable we need to check if we hit a <code>:</code> or <code>}</code> first.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Previous code above</span>
      } <span style="color: #339CDB;">else</span> <span style="color: #339CDB;">if</span> (inside_variable) {
        <span style="color: #35CDAF;">bool</span> <span style="color: #85DDFF;">generic_variable</span> = <span style="color: #339CDB;">false</span>;
        <span style="color: #35CDAF;">bool</span> <span style="color: #85DDFF;">parsing_error</span> = <span style="color: #339CDB;">false</span>;
        <span style="color: #339CDB;">while</span> (*line &amp;&amp; *line != <span style="color: #DB8E73;">':'</span>) {
          <span style="color: #339CDB;">if</span> (*line == <span style="color: #DB8E73;">'}'</span> &amp;&amp; strlen(temp) != <span style="color: #B5CEA8; font-weight: bold;">0</span>) {
            generic_variable = <span style="color: #339CDB;">true</span>;
            <span style="color: #339CDB;">break</span>;
          }
          temp[temp_pos++] = *line++;
        }
        <span style="color: #339CDB;">if</span> (generic_variable) {
          temp[temp_pos++] = <span style="color: #DB8E73;">'\0'</span>;
          mb_ptr += sprintf(
              mb_ptr, <span style="color: #DB8E73;">"\t\tob_ptr += print_value(ob_ptr, %s); \\\n"</span>, temp);
          temp[<span style="color: #B5CEA8; font-weight: bold;">0</span>] = <span style="color: #DB8E73;">'\0'</span>;
          temp_pos = <span style="color: #B5CEA8; font-weight: bold;">0</span>;
          line++;
          inside_variable = <span style="color: #339CDB;">false</span>;
          <span style="color: #339CDB;">continue</span>;
        }
        temp[temp_pos++] = <span style="color: #DB8E73;">'\0'</span>;
        <span style="color: #339CDB;">if</span> (<span style="color: #85DDFF; font-weight: bold;">!</span>*line) {
          parsing_error = <span style="color: #339CDB;">true</span>;
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">Previous code below</span>
<span style="color: #579C4C;">// </span><span style="color: #579C4C;">....</span>
</pre>
</div>

<p>
A new condition <code>generic_variable</code> is added to track when the user omits a format specifier. After parsing the variable name we check if the variable was considered &ldquo;generic&rdquo;. This is where our new macro <code>print_value</code> comes in to print out the variable. We simply output the macro into the generated code, which will then be evaluated once the user compiles their code.
</p>

<p>
The only other change is to unset <code>inside_variable</code> and continue on to the next portion of the line. We also make sure to set <code>temp_pos</code> back to 0 so that if the variable is the last thing on the line we don&rsquo;t accidentally print out garbage data from the temporary buffer afterwards.
</p>

<p>
With those changes in place we should be able to remove all format specifiers from out template.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #339CDB;">!doctype</span> html&gt;
&lt;<span style="color: #D9DAA2;">html</span> <span style="color: #85DDFF;">class</span>=<span style="color: #DB8E73;">"no-js"</span> <span style="color: #85DDFF;">lang</span>=<span style="color: #DB8E73;">""</span>&gt;
    &lt;<span style="color: #D9DAA2;">head</span>&gt;
        &lt;<span style="color: #D9DAA2;">meta</span> <span style="color: #85DDFF;">charset</span>=<span style="color: #DB8E73;">"utf-8"</span>&gt;
        &lt;<span style="color: #D9DAA2;">link</span>&gt;${testing}&lt;/<span style="color: #D9DAA2;">link</span>&gt;
        &lt;<span style="color: #D9DAA2;">style</span>&gt;
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        &lt;/<span style="color: #D9DAA2;">style</span>&gt;
    &lt;/<span style="color: #D9DAA2;">head</span>&gt;
    &lt;<span style="color: #D9DAA2;">body</span>&gt;
        &lt;<span style="color: #D9DAA2;">div</span>&gt;Hi Mom! My name is ${name} ${last_name}&lt;/<span style="color: #D9DAA2;">div</span>&gt;
        @for(int i = 0; i &lt; 10; i++) {
            &lt;<span style="color: #D9DAA2;">div</span>&gt;${i}&lt;/<span style="color: #D9DAA2;">div</span>&gt;
        @}

        &lt;<span style="color: #D9DAA2;">pre</span>&gt;
            <span style="color: #579C4C;">&lt;!-- </span><span style="color: #579C4C;">@include{"index.md"}</span><span style="color: #579C4C;"> --&gt;</span>
        &lt;/<span style="color: #D9DAA2;">pre</span>&gt;

        ${sqrt(32)}
    &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;
</pre>
</div>

<p>
Which can then be run just like before, with the types inferred automatically from the local scope.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;stdio.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;stdlib.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">&lt;math.h&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #DB8E73;">"templates.h"</span>

<span style="color: #35CDAF;">int</span> <span style="color: #D9DAA2;">main</span>() {
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">testing</span> = <span style="color: #DB8E73;">"this is a testing value"</span>;
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">name</span> = <span style="color: #DB8E73;">"Jackson"</span>;
  <span style="color: #35CDAF;">char</span> *<span style="color: #85DDFF;">last_name</span> = <span style="color: #DB8E73;">"Mowry"</span>;
  puts(index_html());
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #339CDB;">!doctype</span> html&gt;
&lt;<span style="color: #D9DAA2;">html</span> <span style="color: #85DDFF;">class</span>=<span style="color: #DB8E73;">"no-js"</span> <span style="color: #85DDFF;">lang</span>=<span style="color: #DB8E73;">""</span>&gt;
    &lt;<span style="color: #D9DAA2;">head</span>&gt;
        &lt;<span style="color: #D9DAA2;">meta</span> <span style="color: #85DDFF;">charset</span>=<span style="color: #DB8E73;">"utf-8"</span>&gt;
        &lt;<span style="color: #D9DAA2;">link</span>&gt;this is a testing value&lt;/<span style="color: #D9DAA2;">link</span>&gt;
        &lt;<span style="color: #D9DAA2;">style</span>&gt;
         body {
             background-color: #1a1a1a; /* Dark background color */
             color: #ffffff; /* Light text color */
         }
        &lt;/<span style="color: #D9DAA2;">style</span>&gt;
    &lt;/<span style="color: #D9DAA2;">head</span>&gt;
    &lt;<span style="color: #D9DAA2;">body</span>&gt;
        &lt;<span style="color: #D9DAA2;">div</span>&gt;Hi Mom! My name is Jackson Mowry&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            &lt;<span style="color: #D9DAA2;">div</span>&gt;0&lt;/<span style="color: #D9DAA2;">div</span>&gt;
            <span style="color: #579C4C;">&lt;!-- </span><span style="color: #579C4C;">........</span><span style="color: #579C4C;"> --&gt;</span>
            &lt;<span style="color: #D9DAA2;">div</span>&gt;9&lt;/<span style="color: #D9DAA2;">div</span>&gt;
    &lt;/<span style="color: #D9DAA2;">body</span>&gt;
&lt;/<span style="color: #D9DAA2;">html</span>&gt;
</pre>
</div>

<p>
Isn&rsquo;t that great! We&rsquo;ve greatly simplified our user experience, without sacrificing type safety. If the user still wishes to have an explicit &ldquo;contract&rdquo; for their template they can specify the format string, and those that aren&rsquo;t concerned can omit it.
</p>

<p>
You may have also noticed that we can now call functions direclty within our variable blocks. Before this wasn&rsquo;t possible because every &ldquo;variable&rdquo; needed to actually be a variable that can be found with an identifier. Now we are able to call functions or access struct fields directly within a variable block, further simplifying the job for template authors.
</p>

<p>
The types are automatically inferred from these values, and our template engine does not need to be concerned with what code is going to be called. That is the beauty and simplicity that comes with providing the primatives to our users and letting them decide what to do with them.
</p>

<p>
If a function the user wants to call returns a more complex value it is easy to pick out the primative fields, or even to perform transformations on that data directly within the template. Remeber that any line beginning with <code>@</code> is just a line of C code.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #D9DAA2;">div</span>&gt;
  @my_struct ms = db_query("billy bob");
  &lt;<span style="color: #D9DAA2;">span</span>&gt;${ms.name}&lt;/<span style="color: #D9DAA2;">span</span>&gt;
  &lt;<span style="color: #D9DAA2;">span</span>&gt;${ms.age}&lt;/<span style="color: #D9DAA2;">span</span>&gt;
&lt;/<span style="color: #D9DAA2;">div</span>&gt;
</pre>
</div>

<p>
This is not something I would personally recommend doing, but the point is that it is possible. Our design allows users to do anything they would like from within a template, as simple or complex as they would like.
</p>
</div>
</div>
</div>
