template_macros.html
<div id="outline-container-org5f5f6c8" class="outline-2">
<h2 id="org5f5f6c8"><span class="underline">Conclusion</span></h2>
<div class="outline-text-2" id="text-org5f5f6c8">
<p>
That is all we needed to take our code from the last article, and move it to a macro based system. Overall I think both approaches have their merits, but I would always choose to use a macro based system that can grab variables from the local scope. If you&rsquo;re working on a project that involves a team of people I think the function approach makes more sense to keep the variable list explicit.
</p>

<p>
I am going to clean the project up and eventually publish it on github. Hopefully someone else can get some use out of it, or at least I won&rsquo;t accidentlly delete the project from my PC. Hopefully you are able to take the lessons learned here and apply them to your own project, or even to port this concept to another programming language.
</p>

<p>
Learning how to parse strings is a very important skill in any language, and C makes that a very hard task. Coding a similar project in a higher level language can get the text processing out of the way and allow you to focus more on the code generation side of things. Either way, just code in what works for you, and whatever will help you learn the most.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 1/15/24</p>
<p class="author">Author: Jackson</p>
</div>
</body>
</html>